<template>
    <section class="user-profile">
        <div class="user-profile__photo">
            <img :src="AvatarImage" alt="AvatarImage">
        </div>
        <div class="user-profile__info">
            <div class="user-profile__info-header">
                <div class="user-profile__wrapper">
                    <div class="user-profile__name">Котов Семен Васильевич</div>
                    <div class="status-wrapper">
                        <div class="status status__primary-bgc">Активен</div>
                    </div>
                </div>

                <dropdown-button class="user-profile__options"
                    :svgName="'dots'"
                    :buttonStyle="'secondary'"
                    :items="[
                        {id:1, text: 'Редактировать'},
                        {id:2, text: 'Изменить пароль'},
                        {id:3, text: 'Просмотр задач пользователя'},
                    ]"
                    :widthListDueContent="true"
                />
            </div>
            <div class="user-profile__info-footer">
                <div class="user-profile__subtitle">О себе:</div>
                <div class="user-profile__about-myself">
                    Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики. Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса и коварных точках с запятой, но текст не дал сбить себя с толку. Он собрал семь своих заглавных букв, подпоясал инициал за пояс и пустился в дорогу. Взобравшись на первую вершину курсивных гор, бросил он последний взгляд назад, на силуэт своего родного города Буквоград, на заголовок деревни Алфавит и на подзаголовок своего переулка Строчка. Грустный риторический вопрос скатился по его щеке и он продолжил свой путь. По дороге встретил текст рукопись. Она предупредила его: «В моей стране все переписывается по несколько раз. Единственное, что от меня осталось, это приставка «и». Возвращайся ты лучше в свою безопасную страну». Не послушавшись рукописи, наш текст продолжил свой путь. Вскоре ему повстречался коварный составитель рекламных текстов, напоивший его языком и речью и заманивший в свое агенство, которое использовало его снова и снова в своих проектах. И если его не переписали, то живет он там до сих пор. Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка р.
                </div>
            </div>
        </div>
    </section>
</template>

<script>
import AvatarImage from '@/assets/images/avatar.png';

export default {
    data() {
        return {
            AvatarImage
        }
    }
}
</script>

<style lang="scss" scoped>
@import '@/components/ProfileItem/index.scss';
</style>